app/controllers/products_controller.rb

SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.all.newest.page params[:page]

SELECT "categories".* FROM "categories" WHERE "categories"."category_id" = ?  [["category_id", 1]]
---
  def edit
    @category = Category.find(@product.category_id)