app/controllers/welcome_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."category_id" = ?  [["category_id", 1]]
SELECT  "products".* FROM "products" LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products"
---
  def home
    @categories = Category.where(category_id: nil)
    @products = Product.all.page params[:page]