app/views/products/index.html.erb

SELECT "products".* FROM "products"
---
      <tr>
        <% if product.image_url_identifier.include? Product::IMAGE_ONLINE_LINK %>