app/views/products/show.html.erb

SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  <% if @tmp != ty.type_id%>
    <b><%= Type.find_by_id(ty.type_id).name %>:</b> <br/>