app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."category_id" IS NULL
SELECT "categories".* FROM "categories"
---
      <div style="width:20%; float: left">
        <% Category.where(category_id: nil).all.each do |cate| %>
          <%= link_to "#{cate.name}", products_path %> <br/>
          <% cate.categories.each do |sub_cate| %>